tutorials/compressible/steadyCompressibleMRFFoam/bentRotorStator/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    bladeRotor
    {
        type            alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    shaftRotor
    {
        type            alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    shroudRotor
    {
        type            alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    bladeStator
    {
        type            alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    shaftStator
    {
        type            alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    shroudStator
    {
        type            alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    frontAndBack
    {
        type            cyclic;
        value           uniform 0;
    }
}

// ************************************************************************* //
