tutorials/compressible/steadyCompressibleMRFFoam/bentRotorStator/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 100;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 100;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 100;
        value           uniform 100;
    }
    bladeRotor
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 100;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    shaftRotor
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 100;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    shroudRotor
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 100;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    bladeStator
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 100;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    shaftStator
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 100;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    shroudStator
    {
        type            compressible::epsilonWallFunction;
        refValue        uniform 0;
        value           uniform 100;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
    }
    frontAndBack
    {
        type            cyclic;
        value           nonuniform List<scalar>
3140
(
100
100
100
100
100
100
100
100
...
)
;
    }
}

// ************************************************************************* //
